org-docs/api_reference/api_reference.org
#+SETUPFILE: ../../org/org-settings.org
#+TITLE: {{{msjs}}} API

* Introduction 
  :PROPERTIES:
  :header_args: :padline no :eval yes
  :END:

This document describes the API of the {{{msjs}}} library.  The
document assumes understanding of the following concepts: /selection
geometry/, /selection mapping/, /selection domain/, /active set/,
/selection path/, /anchor/, /active end/, and /keyboard
cursor/. Please read the {{{msjs}}} tutorial or/and the paper /One Way
to Select Many/ if these concepts are not familiar to you.

The library components are defined as CommonJS modules.  They are
~multiselect.js~, ~default_geometry.js~, ~dom_geometries.js~, and
~ordered_geometries.js~. The main module is ~multiselect.js~. The
other modules define /selection geometry/ classes, intended to be used
as base classes for client-defined selection geometries. The main
module depends on (/requires/) ~default_geometry.js~, but the latter
is still defined as separate module. This is so that modules that
define selection geometries do not need to require ~multiselect.js~;
requiring ~default_geometry.js~ suffices.

* ~multiselect.js~

The names exported by ~multiselect.js~ are:

| ~SelectionState~                                        | [[#sec:selectionstate]]                    |
| ~DefaultGeometry~                                       | [[#sec:defaultgeometry]]                   |
| ~anchor~, ~activeEnd~                                   | [[#sec:path-and-selection-domain-helpers]] |
| ~makeEmptyMap~                                          | [[#sec:path-and-selection-domain-helpers]] |
| ~UP~, ~DOWN~, ~LEFT~, ~RIGHT~, ~NO_DIRECTION~           | [[#sec:direction-constants]]               |
| ~modifierKeys~                                          | [[#sec:event-helpers]]                     |
| ~NONE~, ~SHIFT~, ~CMD~, ~SHIFT_CMD~, ~OPT~, ~SHIFT_OPT~ | [[#sec:event-helpers]]                     |
  
** The ~SelectionState~ class
  :PROPERTIES:
  :CUSTOM_ID: sec:selectionstate
  :END:

The ~SelectionState~ class maintains all of the state of the
selection, which includes the selection status of each element, the
current selection path, undo and redo stacks, and keyboard cursor.

*** Construction

The ~SelectionState~ class has one constructor:

#+BEGIN_SRC js
SelectionState(geometry, refresh, tracking, maxundo)
#+END_SRC

- ~geometry~ is the selection geometry. 
  This object must satisfy the requirements laid out in Section [[#sec:selection-geometry-objects]].
- ~refresh(s)~ is a callback function that visualizes the current
  selection state of the elements. With what kind of argument the
  library invokes the callback depends on the value of ~tracking~:

  - if ~tracking === false~, ~s~ is a /selection mapping/: a function
    from element indices to booleans. For all element indices ~i~,
    ~s(i)~ is ~true~ if ~i~ is selected in ~s~, otherwise ~false~.

    Assuming the element indices are indices to an array named ~elements~ and
    that the function ~visualize(e, b)~ shows the element ~e~ as selected or not,
    depending on whether ~b~ is ~true~ or ~false~. A simple ~refresh~ implementation
    could then be:

    #+BEGIN_SRC js
    function refresh(s) {
      for (var i=0; i<elements.length; ++i) visualize(elements[i], s(i));
    }
    #+END_SRC

  - if ~tracking === true~, ~s~ is a built-in ~Map~ (ECMAScript 6)
    whose keys are the selectable elements' indices and values are
    booleans. The map has entries for exactly those elements that were
    changed since the previous time any of the ~SelectionState~
    object's methods called ~refresh~ (or since the object's
    construction).

    With the same assumptions as above, a simple ~refresh~ implementation
    could be:

    #+BEGIN_SRC js
    function refresh(s) {
      s.forEach(function (value, i) { visualize(elements[i], value); });
    }
    #+END_SRC

- ~tracking~ controls whether /change tracking/ 
   should be used or not (the default is ~false~: no tracking)

- ~maxundo~ is the maximum number of undo operations. The default
  is 10, the minimum is 1 (smaller values are ignored).
  
*** Reset

#+BEGIN_SRC js 
SelectionState.reset();
#+END_SRC

- Resets the ~SelectionState~ object to the same state in which it was immediately after construction.

*** Accessing the selection state of elements

Access to elements' selection state is provided by three functions: ~isSelected~,
~selected~, and ~onSelected~.

#+BEGIN_SRC js
SelectionState.isSelected(i);
#+END_SRC

- The parameter ~i~ is an index to an element.
  Returns ~true~ if the element is selected, ~false~ if not.

#+BEGIN_SRC js
SelectionState.selected();
#+END_SRC

- Returns the indices of the selected elements as a ~Set~ (ECMAScript 6).

#+BEGIN_SRC js
SelectionState.onSelected(vpoint);
#+END_SRC

- Returns ~true~ if ~vpoint~ is on exactly one element and that
  element is selected. Concretely, the result is computed as
  follows. A variable ~path~ is set to ~[]~,
  ~geometry().extendPath(path, vpoint)~ is invoked for its effect on
  ~path~, and then the result of ~geometry().selectionDomain(path)~ is
  observed. If that result has exactly one element and that element is
  selected, then ~onSelected(vpoint)~ returns ~true~, otherwise
  ~false~.
  
