docs/api_reference/api_reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MultiselectJS API</title>
<!-- 2015-12-08 Tue 17:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jaakko Järvi" />
</head>
<body>
<div id="content">
<h1 class="title">MultiselectJS API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. <code>multiselect.js</code></a>
<ul>
<li><a href="#sec:selectionstate">2.1. The <code>SelectionState</code> class</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Construction</a></li>
<li><a href="#sec-2-1-2">2.1.2. Reset</a></li>
<li><a href="#sec-2-1-3">2.1.3. Accessing the selection state of elements</a></li>
<li><a href="#sec-2-1-4">2.1.4. Accessing selection geometry</a></li>
<li><a href="#sec-2-1-5">2.1.5. Accessing selection path and cursor</a></li>
<li><a href="#sec-2-1-6">2.1.6. Click functions</a></li>
<li><a href="#sec-2-1-7">2.1.7. Undo and redo</a></li>
<li><a href="#sec-2-1-8">2.1.8. Filtering</a></li>
<li><a href="#sec-2-1-9">2.1.9. Functions for keyboard commands</a></li>
</ul>
</li>
<li><a href="#sec:selection-geometry-objects">2.2. Selection geometry objects</a>
<ul>
<li><a href="#sec:defaultgeometry">2.2.1. <code>DefaultGeometry</code></a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Helper definitions</a>
<ul>
<li><a href="#sec:path-and-selection-domain-helpers">2.3.1. Helpers for selection paths and selection domains</a></li>
<li><a href="#sec:direction-constants">2.3.2. Constants for arrow key directions</a></li>
<li><a href="#sec:event-helpers">2.3.3. Helpers for event handlers</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the API of the MultiselectJS library.  The
document assumes understanding of the following concepts: <i>selection
geometry</i>, <i>selection mapping</i>, <i>selection domain</i>, <i>active set</i>,
<i>selection path</i>, <i>anchor</i>, <i>active end</i>, and <i>keyboard
cursor</i>. Please read the MultiselectJS tutorial or/and the paper <i>One Way
to Select Many</i> if these concepts are not familiar to you.
</p>

<p>
The library components are defined as CommonJS modules.  They are
<code>multiselect.js</code>, <code>default_geometry.js</code>, <code>dom_geometries.js</code>, and
<code>ordered_geometries.js</code>. The main module is <code>multiselect.js</code>. The
other modules define <i>selection geometry</i> classes, intended to be used
as base classes for client-defined selection geometries. The main
module depends on (<i>requires</i>) <code>default_geometry.js</code>, but the latter
is still defined as separate module. This is so that modules that
define selection geometries do not need to require <code>multiselect.js</code>;
requiring <code>default_geometry.js</code> suffices.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>multiselect.js</code></h2>
<div class="outline-text-2" id="text-2">
<p>
The names exported by <code>multiselect.js</code> are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><code>SelectionState</code></td>
<td class="left"><a href="#sec:selectionstate">2.1</a></td>
</tr>

<tr>
<td class="left"><code>DefaultGeometry</code></td>
<td class="left"><a href="#sec:defaultgeometry">2.2.1</a></td>
</tr>

<tr>
<td class="left"><code>anchor</code>, <code>activeEnd</code></td>
<td class="left"><a href="#sec:path-and-selection-domain-helpers">2.3.1</a></td>
</tr>

<tr>
<td class="left"><code>makeEmptyMap</code></td>
<td class="left"><a href="#sec:path-and-selection-domain-helpers">2.3.1</a></td>
</tr>

<tr>
<td class="left"><code>UP</code>, <code>DOWN</code>, <code>LEFT</code>, <code>RIGHT</code>, <code>NO_DIRECTION</code></td>
<td class="left"><a href="#sec:direction-constants">2.3.2</a></td>
</tr>

<tr>
<td class="left"><code>modifierKeys</code></td>
<td class="left"><a href="#sec:event-helpers">2.3.3</a></td>
</tr>

<tr>
<td class="left"><code>NONE</code>, <code>SHIFT</code>, <code>CMD</code>, <code>SHIFT_CMD</code>, <code>OPT</code>, <code>SHIFT_OPT</code></td>
<td class="left"><a href="#sec:event-helpers">2.3.3</a></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec:selectionstate" class="outline-3">
<h3 id="sec:selectionstate"><a id="sec-2-1"></a><span class="section-number-3">2.1</span> The <code>SelectionState</code> class</h3>
<div class="outline-text-3" id="text-sec:selectionstate">
<p>
The <code>SelectionState</code> class maintains all of the state of the
selection, which includes the selection status of each element, the
current selection path, undo and redo stacks, and keyboard cursor.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Construction</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The <code>SelectionState</code> class has one constructor:
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState(geometry, refresh, tracking, maxundo)
</pre>
</div>

<ul class="org-ul">
<li><code>geometry</code> is the selection geometry. 
This object must satisfy the requirements laid out in Section <a href="#sec:selection-geometry-objects">2.2</a>.</li>
<li><code>refresh(s)</code> is a callback function that visualizes the current
selection state of the elements. With what kind of argument the
library invokes the callback depends on the value of <code>tracking</code>:

<ul class="org-ul">
<li><p>
if <code>tracking === false</code>, <code>s</code> is a <i>selection mapping</i>: a function
from element indices to booleans. For all element indices <code>i</code>,
<code>s(i)</code> is <code>true</code> if <code>i</code> is selected in <code>s</code>, otherwise <code>false</code>.
</p>

<p>
Assuming the element indices are indices to an array named <code>elements</code> and
that the function <code>visualize(e, b)</code> shows the element <code>e</code> as selected or not,
depending on whether <code>b</code> is <code>true</code> or <code>false</code>. A simple <code>refresh</code> implementation
could then be:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">refresh</span>(<span style="color: #BA36A5;">s</span>) {
  <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span>=0; i&lt;elements.length; ++i) visualize(elements[i], s(i));
}
</pre>
</div></li>

<li><p>
if <code>tracking === true</code>, <code>s</code> is a built-in <code>Map</code> (ECMAScript 6)
whose keys are the selectable elements&rsquo; indices and values are
booleans. The map has entries for exactly those elements that were
changed since the previous time any of the <code>SelectionState</code>
object&rsquo;s methods called <code>refresh</code> (or since the object&rsquo;s
construction).
</p>

<p>
With the same assumptions as above, a simple <code>refresh</code> implementation
could be:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">refresh</span>(<span style="color: #BA36A5;">s</span>) {
  s.forEach(<span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">value</span>, <span style="color: #BA36A5;">i</span>) { visualize(elements[i], value); });
}
</pre>
</div></li>
</ul></li>

<li><code>tracking</code> controls whether <i>change tracking</i> 
   should be used or not (the default is <code>false</code>: no tracking)</li>

<li><code>maxundo</code> is the maximum number of undo operations. The default
is 10, the minimum is 1 (smaller values are ignored).</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Reset</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-js">SelectionState.reset();
</pre>
</div>

<ul class="org-ul">
<li>Resets the <code>SelectionState</code> object to the same state in which it was immediately after construction.</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Accessing the selection state of elements</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Access to elements&rsquo; selection state is provided by three functions: <code>isSelected</code>,
<code>selected</code>, and <code>onSelected</code>.
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.isSelected(i);
</pre>
</div>

<ul class="org-ul">
<li>The parameter <code>i</code> is an index to an element.
Returns <code>true</code> if the element is selected, <code>false</code> if not.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.selected();
</pre>
</div>

<ul class="org-ul">
<li>Returns the indices of the selected elements as a <code>Set</code> (ECMAScript 6).</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.onSelected(vpoint);
</pre>
</div>

<ul class="org-ul">
<li>Returns <code>true</code> if <code>vpoint</code> is on exactly one element and that
element is selected. Concretely, the result is computed as
follows. A variable <code>path</code> is set to <code>[]</code>,
<code>geometry().extendPath(path, vpoint)</code> is invoked for its effect on
<code>path</code>, and then the result of <code>geometry().selectionDomain(path)</code> is
observed. If that result has exactly one element and that element is
selected, then <code>onSelected(vpoint)</code> returns <code>true</code>, otherwise
<code>false</code>.</li>
</ul>
</div>
</div>
