org-docs/api_reference/api_reference.org
*** Accessing selection geometry

#+BEGIN_SRC js
SelectionState.geometry();
#+END_SRC

- Returns a reference to the current selection geometry.

#+BEGIN_SRC js
SelectionState.setGeometry(geometry);
#+END_SRC

- Replaces the current selection geometry with ~geometry~.
  Prior to setting the new geometry, the current active set or filter is committed.

*** Accessing selection path and cursor

The selection path and cursor can be queried:

#+BEGIN_SRC js
SelectionState.selectionPath();
SelectionState.cursor();
#+END_SRC

- These functions return a reference to the current, respectively, 
  selection path and keyboard cursor.

The current selection path can be reset to the empty path.
This function needs to be called if the locations of elements
change and thus impact the result of the ~selectionDomain~ method.

#+BEGIN_SRC js
SelectionState.resetPath();
#+END_SRC

- Commits the current active set (whether it was constructed by one of the clicks or by 
  a filter). Resets the current selection path to ~[]~ and keyboard cursor to ~undefined~.

*** Click functions

All ~click~ functions take a ~vpoint~ parameter, which is
a selection space coordinate. The ~click~ and ~cmdClick~ are quite similar:

#+BEGIN_SRC js
SelectionState.click(vpoint);
SelectionState.cmdClick(vpoint, selmode);
#+END_SRC

- The current active set is committed. 
- ~click~ unselects all currently selected elements; ~cmdClick~ does not.
- The current selection path ~_spath~ is set to ~[]~
- ~geometry().extendPath(_spath, vpoint)~ is called.
- If ~extendPath~ returns anything other than ~null~, 
  the keyboard cursor is set to ~vpoint~.
- The new selection domain is computed with the call
  ~selectionPath(_spath, undefined)~.
- The ~refresh~ callback is called (if there are no
  elements whose selection state changes, the call might
  not be made).
- The ~selmode~ parameter is a boolean and it determines
  whether ~cmdClick~ should select or deselect elements. Typically
  it is ~undefined~, in which case ~cmdClick~ function selects if
  ~vpoint~ is on a selected element, and deselects if not.

#+BEGIN_SRC js
SelectionState.shiftClick(vpoint);
#+END_SRC

- ~geometry().extendPath(_spath, vpoint)~ is called.
- If ~extendPath~ returns ~null~, there is no 
  effect (other than the possible modifying of ~_spath~).
- Otherwise,
  the keyboard cursor is set to the last element of 
  (the modified) ~_spath~.
- The new selection domain is computed with the call
  ~selectionDomain(_spath, J)~, where ~J~ is the
  current selection path.
- The ~refresh~ callback is called (if there are no
  elements whose selection state changes, the call might
  not be made).

The ~shiftClick~ function does not execute atomically.
After it has has modified the selection
path, it schedules the rest of its tasks as a separate function
to be executed later (at timeout 0)---unless 
such a function has already been scheduled. 
The selection path can thus be extended (or otherwise
modified) by ~extendPath~ calls several times in between two calls to 
~selectionDomain()~.

*** Undo and redo

The undo and redo functionality is provided by ~undo~ and ~redo~ methods.

#+BEGIN_SRC js
SelectionState.undo();
#+END_SRC

- The effect of the most recent click, keyboard
  command, or committed filter operation is undone.
- The selection path is set to ~[]~.
- The ~refresh~ function is invoked.

The ~undo~ method does not modify the keyboard cursor.

#+BEGIN_SRC js
SelectionState.undo();
#+END_SRC

- The effect of the most recent call to ~undo~ is undone.
- The selection path is set to ~[]~.
- The ~refresh~ function is invoked.

The ~redo~ method does not modify the keyboard cursor.

*** Filtering

The ~filter~ function computes a selection domain based on a predicate
over the element indices.

#+BEGIN_SRC js
SelectionState.filter(predicate, state);
#+END_SRC

- The selection path is set to ~[]~.
- If ~state~ is defined and ~false~, then the filter
  is set to deselect, otherwise to select.
- A new active set is computed with ~geometry().filter(predicate)~.
- If another filter is already active, and the
  new filter and the current filter are both set to ~select~
  or both to ~deselect~, then the 
  current active set is replaced with the new one. Otherwise the 
  current active set is committed before setting the new active set.

#+BEGIN_SRC js
SelectionState.commit();
#+END_SRC

- The current active set is committed, which creates an
  undoable state.

*** Functions for keyboard commands

The library provides three functions that select elements based on the
current keyboard cursor position (~space~, ~cmdSpace~, and ~shiftSpace~),
and three functions that alter the cursor position, and/or select
elements (~arrow~, ~shiftArrow~, and ~cmdArrow~).

#+BEGIN_SRC js
SelectionState.space();
SelectionState.cmdSpace();
SelectionState.shiftSpace();
#+END_SRC

- If the cursor is not defined, these functions attempt to establish a cursor from
  the geometry's default, using the call
  ~geometry().defaultCursor(NO_DIRECTION)~.
- If the cursor is or becomes defined, the corresponding 
  ~click(cursor)~, ~cmdClick(cursor)~, or
  ~shiftClick(cursor)~ function is called; otherwise there is no effect.
- The ~cmdSpace~ and ~shiftSpace~ functions take a parameter (direction)
  that is used internally by the library; client calls to these functions
  should have no arguments.

#+BEGIN_SRC js
SelectionState.arrow(dir);
SelectionState.shiftArrow(dir);
SelectionState.cmdArrow(dir);
#+END_SRC

- The ~dir~ parameter must be one of the library's constants ~UP~,
  ~DOWN~, ~LEFT~, or ~RIGHT~.
- If the cursor is defined, a new cursor is computed by
  ~geometry().step(dir, c)~, where ~c~ is the current cursor.  The
  ~shiftArrow~ function invokes ~cmdSpace~ prior to updating the
  cursor whereas the ~cmdArrow~ function invokes ~cmdSpace~ after updating
  the cursor.
- If the cursor is not defined, these functions try to establish a
  cursor with the call ~geometry().defaultCursor(dir)~. If a cursor
  can be established (~defaultCursor(dir)~ returns something other
  than ~undefined~), then ~shiftArrow~ calls ~shiftSpace(dir)~ and
  ~cmdArrow~ calls ~cmdSpace(dir)~. If a cursor cannot be established,
  there is no effect.

