docs/api_reference/api_reference.html

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Accessing selection geometry</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">

<pre class="src src-js">SelectionState.geometry();
</pre>
</div>

<ul class="org-ul">
<li>Returns a reference to the current selection geometry.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.setGeometry(geometry);
</pre>
</div>

<ul class="org-ul">
<li>Replaces the current selection geometry with <code>geometry</code>.
Prior to setting the new geometry, the current active set or filter is committed.</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Accessing selection path and cursor</h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
The selection path and cursor can be queried:
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.selectionPath();
SelectionState.cursor();
</pre>
</div>

<ul class="org-ul">
<li>These functions return a reference to the current, respectively, 
selection path and keyboard cursor.</li>
</ul>

<p>
The current selection path can be reset to the empty path.
This function needs to be called if the locations of elements
change and thus impact the result of the <code>selectionDomain</code> method.
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.resetPath();
</pre>
</div>

<ul class="org-ul">
<li>Commits the current active set (whether it was constructed by one of the clicks or by 
a filter). Resets the current selection path to <code>[]</code> and keyboard cursor to <code>undefined</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> Click functions</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
All <code>click</code> functions take a <code>vpoint</code> parameter, which is
a selection space coordinate. The <code>click</code> and <code>cmdClick</code> are quite similar:
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.click(vpoint);
SelectionState.cmdClick(vpoint, selmode);
</pre>
</div>

<ul class="org-ul">
<li>The current active set is committed.</li>
<li><code>click</code> unselects all currently selected elements; <code>cmdClick</code> does not.</li>
<li>The current selection path <code>_spath</code> is set to <code>[]</code></li>
<li><code>geometry().extendPath(_spath, vpoint)</code> is called.</li>
<li>If <code>extendPath</code> returns anything other than <code>null</code>, 
the keyboard cursor is set to <code>vpoint</code>.</li>
<li>The new selection domain is computed with the call
<code>selectionPath(_spath, undefined)</code>.</li>
<li>The <code>refresh</code> callback is called (if there are no
elements whose selection state changes, the call might
not be made).</li>
<li>The <code>selmode</code> parameter is a boolean and it determines
whether <code>cmdClick</code> should select or deselect elements. Typically
it is <code>undefined</code>, in which case <code>cmdClick</code> function selects if
<code>vpoint</code> is on a selected element, and deselects if not.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.shiftClick(vpoint);
</pre>
</div>

<ul class="org-ul">
<li><code>geometry().extendPath(_spath, vpoint)</code> is called.</li>
<li>If <code>extendPath</code> returns <code>null</code>, there is no 
effect (other than the possible modifying of <code>_spath</code>).</li>
<li>Otherwise,
the keyboard cursor is set to the last element of 
(the modified) <code>_spath</code>.</li>
<li>The new selection domain is computed with the call
<code>selectionDomain(_spath, J)</code>, where <code>J</code> is the
current selection path.</li>
<li>The <code>refresh</code> callback is called (if there are no
elements whose selection state changes, the call might
not be made).</li>
</ul>

<p>
The <code>shiftClick</code> function does not execute atomically.
After it has has modified the selection
path, it schedules the rest of its tasks as a separate function
to be executed later (at timeout 0)&#x2014;unless 
such a function has already been scheduled. 
The selection path can thus be extended (or otherwise
modified) by <code>extendPath</code> calls several times in between two calls to 
<code>selectionDomain()</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> Undo and redo</h4>
<div class="outline-text-4" id="text-2-1-7">
<p>
The undo and redo functionality is provided by <code>undo</code> and <code>redo</code> methods.
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.undo();
</pre>
</div>

<ul class="org-ul">
<li>The effect of the most recent click, keyboard
command, or committed filter operation is undone.</li>
<li>The selection path is set to <code>[]</code>.</li>
<li>The <code>refresh</code> function is invoked.</li>
</ul>

<p>
The <code>undo</code> method does not modify the keyboard cursor.
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.undo();
</pre>
</div>

<ul class="org-ul">
<li>The effect of the most recent call to <code>undo</code> is undone.</li>
<li>The selection path is set to <code>[]</code>.</li>
<li>The <code>refresh</code> function is invoked.</li>
</ul>

<p>
The <code>redo</code> method does not modify the keyboard cursor.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> Filtering</h4>
<div class="outline-text-4" id="text-2-1-8">
<p>
The <code>filter</code> function computes a selection domain based on a predicate
over the element indices.
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.filter(predicate, state);
</pre>
</div>

<ul class="org-ul">
<li>The selection path is set to <code>[]</code>.</li>
<li>If <code>state</code> is defined and <code>false</code>, then the filter
is set to deselect, otherwise to select.</li>
<li>A new active set is computed with <code>geometry().filter(predicate)</code>.</li>
<li>If another filter is already active, and the
new filter and the current filter are both set to <code>select</code>
or both to <code>deselect</code>, then the 
current active set is replaced with the new one. Otherwise the 
current active set is committed before setting the new active set.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.commit();
</pre>
</div>

<ul class="org-ul">
<li>The current active set is committed, which creates an
undoable state.</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-9" class="outline-4">
<h4 id="sec-2-1-9"><span class="section-number-4">2.1.9</span> Functions for keyboard commands</h4>
<div class="outline-text-4" id="text-2-1-9">
<p>
The library provides three functions that select elements based on the
current keyboard cursor position (<code>space</code>, <code>cmdSpace</code>, and <code>shiftSpace</code>),
and three functions that alter the cursor position, and/or select
elements (<code>arrow</code>, <code>shiftArrow</code>, and <code>cmdArrow</code>).
</p>

<div class="org-src-container">

<pre class="src src-js">SelectionState.space();
SelectionState.cmdSpace();
SelectionState.shiftSpace();
</pre>
</div>

<ul class="org-ul">
<li>If the cursor is not defined, these functions attempt to establish a cursor from
the geometry&rsquo;s default, using the call
<code>geometry().defaultCursor(NO_DIRECTION)</code>.</li>
<li>If the cursor is or becomes defined, the corresponding 
<code>click(cursor)</code>, <code>cmdClick(cursor)</code>, or
<code>shiftClick(cursor)</code> function is called; otherwise there is no effect.</li>
<li>The <code>cmdSpace</code> and <code>shiftSpace</code> functions take a parameter (direction)
that is used internally by the library; client calls to these functions
should have no arguments.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">SelectionState.arrow(dir);
SelectionState.shiftArrow(dir);
SelectionState.cmdArrow(dir);
</pre>
</div>

<ul class="org-ul">
<li>The <code>dir</code> parameter must be one of the library&rsquo;s constants <code>UP</code>,
<code>DOWN</code>, <code>LEFT</code>, or <code>RIGHT</code>.</li>
<li>If the cursor is defined, a new cursor is computed by
<code>geometry().step(dir, c)</code>, where <code>c</code> is the current cursor.  The
<code>shiftArrow</code> function invokes <code>cmdSpace</code> prior to updating the
cursor whereas the <code>cmdArrow</code> function invokes <code>cmdSpace</code> after updating
the cursor.</li>
<li>If the cursor is not defined, these functions try to establish a
cursor with the call <code>geometry().defaultCursor(dir)</code>. If a cursor
can be established (<code>defaultCursor(dir)</code> returns something other
than <code>undefined</code>), then <code>shiftArrow</code> calls <code>shiftSpace(dir)</code> and
<code>cmdArrow</code> calls <code>cmdSpace(dir)</code>. If a cursor cannot be established,
there is no effect.</li>
</ul>
</div>
</div>
</div>
