org-docs/api_reference/api_reference.org
** Selection geometry objects
   :PROPERTIES:
   :CUSTOM_ID: sec:selection-geometry-objects
   :END:

Typically classes that define selection geometries inherit from 
the ~defaultGeometry~ class discussed in Section [[#sec:defaultgeometry]].

A selection geometry object must define the following methods, 
conforming to the requirements listed below. 
All of the methods, except ~m2v~, are callbacks for the library and not
intended to be called by the client.

#+BEGIN_SRC js
m2v(mpoint)
#+END_SRC

  - Transforms ~mpoint~, a point in /mouse coordinates/, to a point in
    selection space.  
  - This function is never called by any of the
    ~SelectionState~'s methods, rather it should be called 
    by the client in the event handlers of the various click events, 
    prior to invoking ~click~, ~cmdClick~, of ~shiftClick~ functions. 
    We make ~m2v~ a method of the selection geometry and insist
    that ~m2v~ function is used to perform the coordinate transformation
    so that event handling code could be reused across selection 
    geometries. 

#+BEGIN_SRC js
extendPath(spath, vpoint)
#+END_SRC

  - Extends the selection path ~spath~ with the selection space point ~vpoint~.
  - To communicate results to the caller, ~extendPath(spath, vp)~ modifies the ~spath~ parameter.
    If ~spath~ is not modified at all, ~extendPath(spath, vp)~ should return ~null~.
  - The ~spath~ parameter is an array of selection state
    points. Typically ~vpoint~ is added at the end of ~spath~, but
    this is not a requirement: ~extendPath~ is allowed to modify
    ~spath~ array in arbitrary ways.  For example, certain values of
    ~vpoint~ could be interpreted as commands that remove or move
    points in ~spath~.
  - Hint: ~spath~ can be non-empty only when invoked from
    ~shiftClick~.  Two consecutive calls to ~extendPath~ where ~spath~
    is non-empty can only come from two consecutive calls to
    ~shiftClick~.

#+BEGIN_SRC js
selectionDomain(spath, J)
#+END_SRC

  - This function should compute the selection domain that ~spath~
    gives rise to.
  - If ~J~ is not ~undefined~, it is the current selection domain
    (computed by the previous call to ~selectionDomain~). The object
    referenced to by ~J~ can be used as such, and modified and
    returned as the result.  The purpose of making the previous
    selection domain available is so that the selection geometry can
    compute the new selection domain faster. For example, in a "snake"
    geometry, the selection geometry could cache the index of the last
    element of the selection path, so that on the next call to
    ~selectionDomain~ it suffices to inspect points from that index
    forward.
  - The ~selectionDomain~ function is called from ~click~, ~cmdClick~,
    ~shiftClick~, and ~onSelected~ functions. The ~J~ parameter is
    defined only when called from ~shiftClick~.
  - Two consecutive calls to ~selectionDomain~ where ~J~ is defined
    can only come from two consecutive calls to ~shiftClick~ that
    operate on the same active set. If ~J~ is not defined, cached
    values should be cleared.

#+BEGIN_SRC js
step(dir, vpoint)
#+END_SRC

  - The function should compute a new point that is one "step" to the
    given direction from ~vpoint~. The function defines the effect of each arrow key
    on the cursor position.
  - The ~dir~ parameter's value is one of the
    library's constants ~UP~, ~DOWN~, ~LEFT~, or ~RIGHT~. 
    If movement to some direction is not supported, 
    ~step~ should return ~vpoint~.
  - The library never calls ~step~ with ~undefined~ value for ~vpoint~.

#+BEGIN_SRC js
defaultCursor(dir)
#+END_SRC

  - This function should return the default location of the keyboard cursor
    for each ~dir~ value. If there is no default for some direction,
    the return value must be ~undefined~.
  - ~dir~ is one of ~UP~, ~DOWN~, ~LEFT~, or ~RIGHT~, ~NO_DIRECTION~.
    The ~NO_DIRECTION~ value indicates that ~defaultCursor~ was called
    from one of ~space~, ~shiftSpace~, or ~cmdSpace~ functions.
    The other four values indicate that it was called from one of the arrow functions.    

#+BEGIN_SRC js
filter(pred)
#+END_SRC

  - This function should return a ~Map~ whose keys are the indices ~i~ for which ~pred(i)~ is true.
    The value for each such index in the map should be ~true~.

*** ~DefaultGeometry~
    :PROPERTIES:
    :CUSTOM_ID: sec:defaultgeometry
    :END:


To help the client in defining selection geometries, {{{msjs}}} defines
the ~DefaultGeometry~ class as follows:

#+BEGIN_SRC js
DefaultGeometry.prototype = {
  m2v : function (mp) { return mp; },
  extendPath : function (spath, vp) { spath.push(vp); },
  step : function (dir, vp) { return undefined; },
  selectionDomain : function(spath, J) { 
    var m = makeEmptyMap();
    for (var i of spath) m.set(i, true); 
    return m;
  },
  defaultCursor : function(dir) { return undefined; },
  filter : undefined
};
#+END_SRC


** Helper definitions

*** Helpers for selection paths and selection domains
    :PROPERTIES:
    :CUSTOM_ID: sec:path-and-selection-domain-helpers
    :END:

#+BEGIN_SRC js
function anchor(path)
#+END_SRC

- The ~anchor~ function returns the first element of the ~path~ array,
  or ~undefined~ if ~path~ is empty.

#+BEGIN_SRC js
function activeEnd(path)
#+END_SRC  

  - The ~activeEnd~ function returns the last element
    of the ~path~ array, or ~undefined~ if ~path~ is empty.

#+BEGIN_SRC js
function makeEmptyMap()
#+END_SRC

  - The ~selectionDomain(path, J)~ method in the selection geometry 
    classes may need to construct a new selection domain.
    The ~makeEmptyMap~ function constructs the kind of 
    object (a built-in ~Map~) that the library expects.

