docs/api_reference/api_reference.html

<div id="outline-container-sec:selection-geometry-objects" class="outline-3">
<h3 id="sec:selection-geometry-objects"><a id="sec-2-2"></a><span class="section-number-3">2.2</span> Selection geometry objects</h3>
<div class="outline-text-3" id="text-sec:selection-geometry-objects">
<p>
Typically classes that define selection geometries inherit from 
the <code>defaultGeometry</code> class discussed in Section <a href="#sec:defaultgeometry">2.2.1</a>.
</p>

<p>
A selection geometry object must define the following methods, 
conforming to the requirements listed below. 
All of the methods, except <code>m2v</code>, are callbacks for the library and not
intended to be called by the client.
</p>

<div class="org-src-container">

<pre class="src src-js">m2v(mpoint)
</pre>
</div>

<ul class="org-ul">
<li>Transforms <code>mpoint</code>, a point in <i>mouse coordinates</i>, to a point in
selection space.</li>
<li>This function is never called by any of the
<code>SelectionState</code>&rsquo;s methods, rather it should be called 
by the client in the event handlers of the various click events, 
prior to invoking <code>click</code>, <code>cmdClick</code>, of <code>shiftClick</code> functions. 
We make <code>m2v</code> a method of the selection geometry and insist
that <code>m2v</code> function is used to perform the coordinate transformation
so that event handling code could be reused across selection 
geometries.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">extendPath(spath, vpoint)
</pre>
</div>

<ul class="org-ul">
<li>Extends the selection path <code>spath</code> with the selection space point <code>vpoint</code>.</li>
<li>To communicate results to the caller, <code>extendPath(spath, vp)</code> modifies the <code>spath</code> parameter.
If <code>spath</code> is not modified at all, <code>extendPath(spath, vp)</code> should return <code>null</code>.</li>
<li>The <code>spath</code> parameter is an array of selection state
points. Typically <code>vpoint</code> is added at the end of <code>spath</code>, but
this is not a requirement: <code>extendPath</code> is allowed to modify
<code>spath</code> array in arbitrary ways.  For example, certain values of
<code>vpoint</code> could be interpreted as commands that remove or move
points in <code>spath</code>.</li>
<li>Hint: <code>spath</code> can be non-empty only when invoked from
<code>shiftClick</code>.  Two consecutive calls to <code>extendPath</code> where <code>spath</code>
is non-empty can only come from two consecutive calls to
<code>shiftClick</code>.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">selectionDomain(spath, J)
</pre>
</div>

<ul class="org-ul">
<li>This function should compute the selection domain that <code>spath</code>
    gives rise to.</li>
<li>If <code>J</code> is not <code>undefined</code>, it is the current selection domain
(computed by the previous call to <code>selectionDomain</code>). The object
referenced to by <code>J</code> can be used as such, and modified and
returned as the result.  The purpose of making the previous
selection domain available is so that the selection geometry can
compute the new selection domain faster. For example, in a &ldquo;snake&rdquo;
geometry, the selection geometry could cache the index of the last
element of the selection path, so that on the next call to
<code>selectionDomain</code> it suffices to inspect points from that index
forward.</li>
<li>The <code>selectionDomain</code> function is called from <code>click</code>, <code>cmdClick</code>,
<code>shiftClick</code>, and <code>onSelected</code> functions. The <code>J</code> parameter is
defined only when called from <code>shiftClick</code>.</li>
<li>Two consecutive calls to <code>selectionDomain</code> where <code>J</code> is defined
can only come from two consecutive calls to <code>shiftClick</code> that
operate on the same active set. If <code>J</code> is not defined, cached
values should be cleared.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">step(dir, vpoint)
</pre>
</div>

<ul class="org-ul">
<li>The function should compute a new point that is one &ldquo;step&rdquo; to the
given direction from <code>vpoint</code>. The function defines the effect of each arrow key
on the cursor position.</li>
<li>The <code>dir</code> parameter&rsquo;s value is one of the
library&rsquo;s constants <code>UP</code>, <code>DOWN</code>, <code>LEFT</code>, or <code>RIGHT</code>. 
If movement to some direction is not supported, 
<code>step</code> should return <code>vpoint</code>.</li>
<li>The library never calls <code>step</code> with <code>undefined</code> value for <code>vpoint</code>.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">defaultCursor(dir)
</pre>
</div>

<ul class="org-ul">
<li>This function should return the default location of the keyboard cursor
for each <code>dir</code> value. If there is no default for some direction,
the return value must be <code>undefined</code>.</li>
<li><code>dir</code> is one of <code>UP</code>, <code>DOWN</code>, <code>LEFT</code>, or <code>RIGHT</code>, <code>NO_DIRECTION</code>.
The <code>NO_DIRECTION</code> value indicates that <code>defaultCursor</code> was called
from one of <code>space</code>, <code>shiftSpace</code>, or <code>cmdSpace</code> functions.
The other four values indicate that it was called from one of the arrow functions.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js">filter(pred)
</pre>
</div>

<ul class="org-ul">
<li>This function should return a <code>Map</code> whose keys are the indices <code>i</code> for which <code>pred(i)</code> is true.
The value for each such index in the map should be <code>true</code>.</li>
</ul>
</div>

<div id="outline-container-sec:defaultgeometry" class="outline-4">
<h4 id="sec:defaultgeometry"><a id="sec-2-2-1"></a><span class="section-number-4">2.2.1</span> <code>DefaultGeometry</code></h4>
<div class="outline-text-4" id="text-sec:defaultgeometry">
<p>
To help the client in defining selection geometries, MultiselectJS defines
the <code>DefaultGeometry</code> class as follows:
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #6434A3;">DefaultGeometry</span>.<span style="color: #8b1a1a;">prototype</span> = {
  <span style="color: #006699;">m2v</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">mp</span>) { <span style="color: #0000FF;">return</span> mp; },
  <span style="color: #006699;">extendPath</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">spath</span>, <span style="color: #BA36A5;">vp</span>) { spath.push(vp); },
  <span style="color: #006699;">step</span> : <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">dir</span>, <span style="color: #BA36A5;">vp</span>) { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; },
  <span style="color: #006699;">selectionDomain</span> : <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">spath</span>, <span style="color: #BA36A5;">J</span>) { 
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">m</span> = makeEmptyMap();
    <span style="color: #0000FF;">for</span> (<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">i</span> of spath) m.set(i, <span style="color: #8b1a1a;">true</span>); 
    <span style="color: #0000FF;">return</span> m;
  },
  <span style="color: #006699;">defaultCursor</span> : <span style="color: #0000FF;">function</span>(<span style="color: #BA36A5;">dir</span>) { <span style="color: #0000FF;">return</span> <span style="color: #8b1a1a;">undefined</span>; },
  filter : <span style="color: #8b1a1a;">undefined</span>
};
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Helper definitions</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec:path-and-selection-domain-helpers" class="outline-4">
<h4 id="sec:path-and-selection-domain-helpers"><a id="sec-2-3-1"></a><span class="section-number-4">2.3.1</span> Helpers for selection paths and selection domains</h4>
<div class="outline-text-4" id="text-sec:path-and-selection-domain-helpers">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">anchor</span>(<span style="color: #BA36A5;">path</span>)
</pre>
</div>

<ul class="org-ul">
<li>The <code>anchor</code> function returns the first element of the <code>path</code> array,
or <code>undefined</code> if <code>path</code> is empty.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">activeEnd</span>(<span style="color: #BA36A5;">path</span>)
</pre>
</div>

<ul class="org-ul">
<li>The <code>activeEnd</code> function returns the last element
of the <code>path</code> array, or <code>undefined</code> if <code>path</code> is empty.</li>
</ul>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">makeEmptyMap</span>()
</pre>
</div>

<ul class="org-ul">
<li>The <code>selectionDomain(path, J)</code> method in the selection geometry 
classes may need to construct a new selection domain.
The <code>makeEmptyMap</code> function constructs the kind of 
object (a built-in <code>Map</code>) that the library expects.</li>
</ul>
</div>
</div>
