org-docs/api_reference/api_reference.org
*** Constants for arrow key directions
    :PROPERTIES:
    :CUSTOM_ID: sec:direction-constants
    :END:

The constants that specify the directions of the four arrow keys are

#+BEGIN_SRC js
UP;
DOWN;
LEFT;
RIGHT;
NO_DIRECTION;
#+END_SRC

The first four should be used in implementing the selection geometry's
~step~ function and used as parameters to ~SelectionState~'s ~arrow~,
~shiftArrow~, and ~cmdArrow~ functions when they are called from
client's event handlers.  The fifth value ~NO_DIRECTION~ can be
recognized in the ~defaultCursor~ function to give a default cursor
position when the ~space~ functions are invoked with an undefined
cursor.

*** Helpers for event handlers
    :PROPERTIES:
    :CUSTOM_ID: sec:event-helpers
    :END:

To figure out which modifier keys were pressed
during a shift-click or a keypress is a little tricky. 
{{{msjs}}} implements the logic in the ~modifierKeys(event)~ function. 

#+BEGIN_SRC js
modifierKeys(event)
#+END_SRC

The ~event~ is assumed to be JavaScript's 
~KeyboardEvent~ or ~MouseEvent~.
The table below shows how different key combinations 
are mapped to the result. The first matching combination
is selected (so that, e.g., /shift+cmd+opt/ is interpreted
as /shift+cmd/). 

|---------------+--------------|
| Modifiers     | Return value |
|---------------+--------------|
| /shift+cmd/   | ~SHIFT_CMD~  |
| /cmd/         | ~CMD~        |
| /shift+opt/   | ~SHIFT_OPT~  |
| /opt/         | ~OPT~        |
| /shift/       | ~SHIFT~      |
| anything else | ~NONE~       |
|---------------+--------------|

The /cmd/ modifier in OSX corresponds to the /ctrl/ modifier
in Windows/Linux, and the /opt/ modifier corresponds to 
/alt/.

The constants ~NONE~, ~SHIFT~, ~CMD~, ~SHIFT_CMD~, ~OPT~, and
~SHIFT_OPT~ are part of the public API of the library.




* File local variables                                     :ARCHIVE:noexport:
  
# Local Variables:
# mode: org
# org-html-postamble: nil
# org-babel-use-quick-and-dirty-noweb-expansion: t
# org-confirm-babel-evaluate: nil
# End:

#  LocalWords:  SETUPFILE msjs args padline eval multi DOM Indices fn
#  LocalWords:  indices booleans selectable SRC imagemagick png tikz
#  LocalWords:  usepackage iminoptions imoutoptions tikzstyle tt edef
#  LocalWords:  scriptsize elementsize anchornode sep cursornode pred
#  LocalWords:  pathnode tikzpicture selectionDomain cmdType ctrl API
#  LocalWords:  optimizations extendPath defaultCursor anchorselected
#  LocalWords:  cursorselected undoable html noweb js css javascript
#  LocalWords:  addEventListener DOMContentLoaded src px const CMD vp
#  LocalWords:  pointInRectangle modifierKeys evt shiftKey isCmdKey
#  LocalWords:  altKey metaKey ctrlKey OrderedList OrderedGeometry td
#  LocalWords:  getBoundingClientRect multiselect makeEmptyMap br pos
#  LocalWords:  activeEnd selectableArea getElementById selectables
#  LocalWords:  getElementsByClassName SelectionState preventDefault
#  LocalWords:  mousedownHandler stopPropagation clientX clientY ATTR
#  LocalWords:  cmdClick shiftClick mousedown showAnimals textContent
#  LocalWords:  unselected EcmaScript DefaultGeometry superclass mk
#  LocalWords:  boolean isSelected topLeftCorner offsetRectangle dir
#  LocalWords:  getOffsetRectangle offseteMousePos getClientRects ctx
#  LocalWords:  RowwiseGeometry rectangleIntersect findClosestP rect
#  LocalWords:  isAbove centerPoint setupMouseEvents mousemove resize
#  LocalWords:  mousemoveHandler mouseup mouseupHandler mousePos rw
#  LocalWords:  removeEventListener setupKeyboardEvents keydown cls
#  LocalWords:  keydownHandler callArrow callSpace callUndoRedo dx dy
#  LocalWords:  cmdArrow shiftArrow cmdSpace shiftSpace forEach sqrt
#  LocalWords:  toggleClass createCanvas createElement insertBefore
#  LocalWords:  firstChild resizeCanvas drawIndicators drawAnchor rc
#  LocalWords:  drawCursor drawRubber getContext clearRect DarkRed de
#  LocalWords:  strokeStyle beginPath iPhoto tabIndex setAttribute
#  LocalWords:  appendChild mkRefresh rectangeIntersect selectionPath
#  LocalWords:  offsetMousePos candidateIndex candidateDistance keyup
#  LocalWords:  resized str indexOf setPath setGeometry angelshark
#  LocalWords:  blenny blowfish bluefin clownfish coelacanth goby koi
#  LocalWords:  cookiecutter dragonfish Dunkleosteus glassfish apua'a
#  LocalWords:  grayling hagfish hatchetfish humuhumu nukunuku loach
#  LocalWords:  icefish jackfish lanternfish mako Megalodon megamouth
#  LocalWords:  monkfish needlefish oarfish roughy Orthacanthus chr
#  LocalWords:  paddlefish parrotfish pollock pufferfish pupfish prev
#  LocalWords:  triggerfish quillfish remora rockfish sawfish sculpin
#  LocalWords:  seabass seadragon velvetfish viperfish yellowjack ACM
#  LocalWords:  yellowtail zebrafish isNumeric shiftSelectP selectP
#  LocalWords:  SnakeGeometry lineRectIntersect mkRectangle Prasad
#  LocalWords:  pointEquals lineIntersect Mukesh's xlines Mukesh DONT
#  LocalWords:  COLLINEAR sameSigns eqns denom num noexport emacs npm
#  LocalWords:  concat postamble href viewSource substring jQuery dom
#  LocalWords:  lastIndexOf CommonJS decrement textbox selectionstate
#  LocalWords:  defaultgeometry maxundo onSelected vpoint resetPath
#  LocalWords:  selmode unselects spath defaultGeometry mpoint cmd
#  LocalWords:  keypress KeyboardEvent MouseEvent OSX
