docs/api_reference/api_reference.html

<div id="outline-container-sec:direction-constants" class="outline-4">
<h4 id="sec:direction-constants"><a id="sec-2-3-2"></a><span class="section-number-4">2.3.2</span> Constants for arrow key directions</h4>
<div class="outline-text-4" id="text-sec:direction-constants">
<p>
The constants that specify the directions of the four arrow keys are
</p>

<div class="org-src-container">

<pre class="src src-js">UP;
DOWN;
LEFT;
RIGHT;
NO_DIRECTION;
</pre>
</div>

<p>
The first four should be used in implementing the selection geometry&rsquo;s
<code>step</code> function and used as parameters to <code>SelectionState</code>&rsquo;s <code>arrow</code>,
<code>shiftArrow</code>, and <code>cmdArrow</code> functions when they are called from
client&rsquo;s event handlers.  The fifth value <code>NO_DIRECTION</code> can be
recognized in the <code>defaultCursor</code> function to give a default cursor
position when the <code>space</code> functions are invoked with an undefined
cursor.
</p>
</div>
</div>

<div id="outline-container-sec:event-helpers" class="outline-4">
<h4 id="sec:event-helpers"><a id="sec-2-3-3"></a><span class="section-number-4">2.3.3</span> Helpers for event handlers</h4>
<div class="outline-text-4" id="text-sec:event-helpers">
<p>
To figure out which modifier keys were pressed
during a shift-click or a keypress is a little tricky. 
MultiselectJS implements the logic in the <code>modifierKeys(event)</code> function. 
</p>

<div class="org-src-container">

<pre class="src src-js">modifierKeys(event)
</pre>
</div>

<p>
The <code>event</code> is assumed to be JavaScript&rsquo;s 
<code>KeyboardEvent</code> or <code>MouseEvent</code>.
The table below shows how different key combinations 
are mapped to the result. The first matching combination
is selected (so that, e.g., <i>shift+cmd+opt</i> is interpreted
as <i>shift+cmd</i>). 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Modifiers</th>
<th scope="col" class="left">Return value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><i>shift+cmd</i></td>
<td class="left"><code>SHIFT_CMD</code></td>
</tr>

<tr>
<td class="left"><i>cmd</i></td>
<td class="left"><code>CMD</code></td>
</tr>

<tr>
<td class="left"><i>shift+opt</i></td>
<td class="left"><code>SHIFT_OPT</code></td>
</tr>

<tr>
<td class="left"><i>opt</i></td>
<td class="left"><code>OPT</code></td>
</tr>

<tr>
<td class="left"><i>shift</i></td>
<td class="left"><code>SHIFT</code></td>
</tr>

<tr>
<td class="left">anything else</td>
<td class="left"><code>NONE</code></td>
</tr>
</tbody>
</table>

<p>
The <i>cmd</i> modifier in OSX corresponds to the <i>ctrl</i> modifier
in Windows/Linux, and the <i>opt</i> modifier corresponds to 
<i>alt</i>.
</p>

<p>
The constants <code>NONE</code>, <code>SHIFT</code>, <code>CMD</code>, <code>SHIFT_CMD</code>, <code>OPT</code>, and
<code>SHIFT_OPT</code> are part of the public API of the library.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
